/* 2053385 高逸轩 */

/***************************************************************************
*
	文件名:fraction_main.cpp
	功能  :进行分数类各功能的测试
*
****************************************************************************/

#define _CRT_SECURE_NO_WARNINGS
#include<iostream>
#include<stdio.h>
#include<iomanip>
#include<cstring>
#include<stdlib.h>
#include<cmath>
#include<conio.h>
#include"fraction.h"

using namespace std;

/*菜单选择模式*/
bool menu();
/*测试模式1*/
void test_mode_1();
/*测试模式2*/
void test_mode_2();
/*读取回车键*/
void wait_enter();

int main()
{
	/***************************************************************************
	Tips:
	①：测试共两个模式，供用户自身选择:
	模式一无需输入，测试数据由程序本身提供，输出数据于控制台窗口和文件.
	模式二需要用户选择测试功能、输入测试数据，输出数据于控制台窗口和文件.

	②：请保证输入数据类型及范围正确.

	③：对于错误操作(如除以0、对0取倒数等)，进行特判，并将分数置为 0/1 ，所以请尽量避免输入 0/1 作为数据0.0

	④：由于③，默认将0.0记作 0/2 以区分.
	***************************************************************************/

	!menu() ? test_mode_1() : test_mode_2();
	cout << "本次测试已经结束." << endl;
	wait_enter();
	return 0;
}